Tekla Open API Reference for Tekla Structures 2025
GADrawing Constructor
Overload List
Name | Description
GADrawing()
 Instantiates a new GA drawing using standard attributes.
GADrawing(String)
 Instantiates a new GA drawing with the given attributes.
GADrawing(String, String)
 Instantiates a new GA drawing with the given name and attribute file.
GADrawing(String, Size)
 Instantiates a new GA drawing with attributes. Loads the specified attribute file and overrides with the given layout attributes.
Top
See Also
Reference
GADrawing Class
Tekla.Structures.Drawing Namespace